{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "sentence-transformers/all-MiniLM-L6-v2",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "key",
    "dense",
    "value",
    "query"
  ],
  "task_type": "FEATURE_EXTRACTION",
  "use_dora": false,
  "use_rslora": false
}